In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("house.csv")
data

    House  Room  Floor  Age  Price
0     101     2      2   19   2000
1     102     4      3   21   2000
2     103     3      4   32   5000
3     104     5      5   23   3000
4     105     6      6   20   3500
5     106     7      7   25   2000
6     107     2      3   27   1500
7     108     3      6   21   4000
8     109     3      3   21   4500
9     110     7      6   27   3200
10    111     5      2   26   3000
11    112     7      4   30   2500
12    113     4      3   21   2000
13    114     3      5   32   2000
14    115     4      6   23   5000
15    116     2      7   20   3000
16    117     2      2   25   3500
17    118     2      3   27   2000
18    119     4      3   21   1500
19    120     5      7   21   4000
20    121     4      2   27   4500
21    122     6      3   26   4800
22    123     7      5   30   3200
23    124     4      6   22   2200
24    125     3      4   19   2800

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   House   25 non-null     int64
 1   Room    25 non-null     int64
 2   Floor   25 non-null     int64
 3   Age     25 non-null     int64
 4   Price   25 non-null     int64
dtypes: int64(5)
memory usage: 1.1 KB

In [4]:
data.head()

   House  Room  Floor  Age  Price
0    101     2      2   19   2000
1    102     4      3   21   2000
2    103     3      4   32   5000
3    104     5      5   23   3000
4    105     6      6   20   3500

In [7]:
data.tail()

    House  Room  Floor  Age  Price
20    121     4      2   27   4500
21    122     6      3   26   4800
22    123     7      5   30   3200
23    124     4      6   22   2200
24    125     3      4   19   2800

In [8]:
data.describe()

            House       Room      Floor        Age        Price
count   25.000000  25.000000  25.000000  25.000000    25.000000
mean   113.000000   4.160000   4.280000  24.240000  3068.000000
std      7.359801   1.724336   1.720465   4.013311  1111.200552
min    101.000000   2.000000   2.000000  19.000000  1500.000000
25%    107.000000   3.000000   3.000000  21.000000  2000.000000
50%    113.000000   4.000000   4.000000  23.000000  3000.000000
75%    119.000000   5.000000   6.000000  27.000000  4000.000000
max    125.000000   7.000000   7.000000  32.000000  5000.000000

In [12]:
data['Price']

0     2000
1     2000
2     5000
3     3000
4     3500
5     2000
6     1500
7     4000
8     4500
9     3200
10    3000
11    2500
12    2000
13    2000
14    5000
15    3000
16    3500
17    2000
18    1500
19    4000
20    4500
21    4800
22    3200
23    2200
24    2800
Name: Price, dtype: int64

In [17]:
X = data.drop(columns = ['Price'])

In [20]:
X

    House  Room  Floor  Age
0     101     2      2   19
1     102     4      3   21
2     103     3      4   32
3     104     5      5   23
4     105     6      6   20
5     106     7      7   25
6     107     2      3   27
7     108     3      6   21
8     109     3      3   21
9     110     7      6   27
10    111     5      2   26
11    112     7      4   30
12    113     4      3   21
13    114     3      5   32
14    115     4      6   23
15    116     2      7   20
16    117     2      2   25
17    118     2      3   27
18    119     4      3   21
19    120     5      7   21
20    121     4      2   27
21    122     6      3   26
22    123     7      5   30
23    124     4      6   22
24    125     3      4   19

In [21]:
Y = data ['Price']

In [22]:
Y

0     2000
1     2000
2     5000
3     3000
4     3500
5     2000
6     1500
7     4000
8     4500
9     3200
10    3000
11    2500
12    2000
13    2000
14    5000
15    3000
16    3500
17    2000
18    1500
19    4000
20    4500
21    4800
22    3200
23    2200
24    2800
Name: Price, dtype: int64

In [25]:
hello = data[data['Age']<20]
print(hello)

    House  Room  Floor  Age  Price
0     101     2      2   19   2000
24    125     3      4   19   2800

    House  Room  Floor  Age  Price
0     101     2      2   19   2000
24    125     3      4   19   2800

In [26]:
import numpy as np

In [34]:
arr1 = np.array([18,3,4,23])
arr2 = np.array([18,3,44,5,])
print(arr1+arr2)
print(arr1-arr2)
print(arr1*arr2)
print(arr1/arr2)

[36  6 48 28]
[  0   0 -40  18]
[324   9 176 115]
[1.         1.         0.09090909 4.6       ]

In [35]:
np.max(arr1)

23

In [41]:
np.min(arr2)

3

In [42]:
zeros = np.zeros((1,2))

In [43]:
zeros

array([[0., 0.]])

In [44]:
matrix= np.random.rand(3,4)

In [45]:
matrix

array([[0.8573538 , 0.19352503, 0.26859363, 0.40253748],
       [0.02716486, 0.55813746, 0.59078022, 0.06954224],
       [0.32393212, 0.20412382, 0.6873585 , 0.96487439]])

In [47]:
new_array=np.array([20,23,25,27])
sum(new_array)

95

In [48]:
new_array[0:2]

array([20, 23])

In [56]:
new_arr=[2,3,4,5,6]

In [53]:
new_arr[0:4]

[2, 3, 4, 5]

In [54]:
np.mean(new_array)

23.75

In [55]:
np.mean(new_arr)

4.0

In [59]:
sum(new_arr)

20

In [60]:
np.std(new_arr)

1.4142135623730951

In [61]:
np.unique(new_arr)

array([2, 3, 4, 5, 6])